using System.Diagnostics;

namespace HW1
{
    /// <summary>
    /// 1. В ходе выполнения практического задания необходимо выбрать любой процесс из окружающей жизни. Для выбранного процесса построить:
    /// диаграмму вариантов использования(прецедентов);
    /// диаграмму взаимодействия(последовательности);
    /// диаграмму классов.
    /// 2. * Осуществить проектирование работы приложения файлового менеджера (выделить значимые с точки зрения Б/П сущности, возможные взаимодействия между ними.
    /// </summary>
    internal class Diagrams
    { 
        internal static void Diagram()
        {            
            Process.Start(new ProcessStartInfo(@"HW3.jpg") { UseShellExecute = true });
        }
    }
}

